{
  "auto_mapping": null,
  "base_model_name_or_path": "/data/jasonzhou/Models/Qwen1.5-0.5B-Chat",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 8,
  "lora_dropout": 0.0,
  "modules_to_save": [
    "word_embeddings"
  ],
  "peft_type": "LORA",
  "r": 8,
  "revision": null,
  "target_modules": [
    "20.self_attn.q_proj",
    "20.self_attn.k_proj",
    "20.self_attn.v_proj"
  ],
  "task_type": "CAUSAL_LM"
}